tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

tap "cloudflare/cloudflare"

brew "curl"
brew "deno"
brew "dog"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "just"
brew "mas"
brew "n"
brew "nmap"
brew "nvim"
brew "pandoc"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "cloudflare/cloudflare/cloudflared"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

cask "brave-browser"
cask "docker"
cask "imagealpha"
cask "imageoptim"
cask "kitty"
cask "qlmarkdown"
cask "rectangle"
cask "spotify"
cask "syntax-highlight"
cask "visual-studio-code"
cask "vlc"

# mas "1Password 7", id: 1333542190
mas "GarageBand", id: 682658836
mas "MindNode", id: 1289197285
